testcase/FreeSpace/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e-4;

deltaT          1e-6;

adjustTimeStep  no;

maxCo		0.9;

writeControl    runTime;

// writeTimes (0.0650e-4 0.1350e-4 0.2050e-4 0.2750e-4 0.3450e-4 0.4150e-4 0.4850e-4 0.5550e-4 0.6250e-4 0.6950e-4 0.7650e-4 0.8350e-4 0.9050e-4 0.9750e-4);

writeInterval   1e-6;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;


// ************************************************************************* //
